{"title":"Starting Strength","author":"Rippetoe, Mark","chapters":[{"title":"The Squat","subchapters":[{"title":"Learning to Squat","highlights":["heels about shoulder width apart and the toes pointed out at about 30 degrees.","put your elbows against your knees, with the palms of your hands together, and shove your knees out","knees are shoved out to where they are in a parallel line with your feet,","your back is inclined at about a 45-degree angle,","come up by driving your butt straight up in the air. Up, not forward.","Think about a chain hooked to your hips, pulling you straight up out of the bottom (Figure 2-14). Don’t think about your knees straightening out or your feet pushing against the floor, and don’t think about your legs. Just drive your hips up out of the bottom, and the rest will take care of itself.","fix your eyes on a position on the floor 4 or 5 feet in front of you.","Set the rack height so that the bar in the rack is at about the level of your mid-sternum.","Face the bar. Always an empty bar at first. ALWAYS.","a narrower grip tightens your shoulder muscles so that the bar is supported by muscle and doesn’t dig into your back. The thumbs should be placed on top of the bar so that the wrists can be held in a","straight line with the forearms.","The elbows should be cranked up to trap the bar between the hands and the back, but not so high that the upper back is forced to round over.","each set, narrow your grip a little until it is tight and secure. Mark this position as the grip you will use.","Place the bar in the correct position, just immediately under the bone","you feel at the top of the shoulder blades – the spine of the scapula","secure it in place by lifting your elbows and chest at the same time","ALWAYS STEP BACK OUT OF THE RACK. ALWAYS.","tighten the muscles and then take the weight onto tight muscles","One step back out of the rack with good form is enough to clear the rack","take a big breath and hold it, look down at a spot on the floor about 4– 5 feet in front of you, and squat.","To rack the bar safely and easily, walk forward until it touches the vertical parts of the rack. Find the uprights, not the hooks.","do a couple more sets of five reps with the empty bar to nail down the form, and then add weight, do another set of five, and keep increasing in even increments until the next increase would compromise the form. Sets of five are a good number to learn with","Lightweight, unconditioned kids need to go up in 10– 15 lb or 5– 7.5 kg jumps. Older or stronger trainees can use 20– 30 lb or 10– 15 kg increments."]},{"title":"Leverage and Moment - The Basis of Barbell Training","highlights":["your ability to maintain a vertical relationship between barbell and mid-foot – is your ability to use good technique in lifting."]},{"title":"Common Problems Everyone Should Know How to Solve","highlights":["take an even grip somewhere between the score mark and the end of the knurl.","In the correct position, the wrist is straight, neither flexed nor extended; none of the weight is over any","part of the arm, wrist, or hand; and all of the weight is on the back","The most dangerous movement for the spine is flexion with rotation under a load, and we don’t do this in barbell training","lie down on your belly on the floor, put your hands behind your head, lift your elbows,","lie back down, straighten your knees, and then lift your knees up off the floor. To increase the sensation, try to get your quads off the floor, too.","Assume this arched position again immediately while standing, and repeat it several times. Now, just to be sure, unlock your knees and hips to about a half-squat position","form errors in many exercises represent the loss of the ability to generate force due to a loss in the position required for force production.","It is important that the bounce is not followed by a pause and then a drive up. The bounce must be incorporated into the drive","Think about the “up” drive all the way down during the descent.","your knees could be anywhere from very slightly behind your toes, with short femurs and long tibias, to 3 or 4 inches in front of the toes,","“lift with your hips, not your back,”"]},{"title":"The Master Cue","highlights":["This trick is simply keeping the barbell over the mid-foot","by thinking about doing so."]},{"title":"Breathing","highlights":["The Valsalva maneuver is the proper term for holding the breath against a closed glottis while pressure is applied by the abdominal and thoracic muscles.","it is a good practice to take and hold the biggest breath you can before each rep of your heaviest sets."]},{"title":"Spotting the Squat","highlights":["The squat and the bench press are the only two exercises in this basic program that require spotters,","the correct height for the bar: low enough that a below-parallel squat doesn’t touch them, and high enough that a missed rep doesn’t drive you into the floor.","the pin holes spaced at a 2 ½- to 3-inch interval","(a 4-inch or greater interval is not useful)."]},{"title":"Personal Equipment","highlights":["Shoes are the only piece of personal equipment that you really need to own.","Squatting in front of a mirror is a really bad idea.","Cervical rotation under a heavy bar is as bad an idea as cervical overextension under a heavy bar.","Learn to feel the correct position, not to merely see it."]}]},{"title":"The Press","subchapters":[{"title":"Learning to Press","highlights":["The press starts at the rack with the empty bar. It should be set at the same height as for the squat, at about the middle of the sternum.","The width is such that it places the forearms in a vertical position","Grip width, just outside the shoulders,","The grip should position the bones of the forearm directly under the bar,","set the grip width at your index fingers, and then rotate your hands into pronation by pointing your thumbs down toward your feet.","Then, just lay your fingers down on the bar and squeeze the fingertips into the bar.","the wrist angle in A is neutral for the fisted grip, about 10-15 ° of extension, the best position for maximum gripping force.","your elbows should now move to a position just in front of the bar when viewed from the side.","Shrug your shoulders up and forward just a little;","have the bar resting on top of your anterior deltoids, the meaty part of your shoulders, at the start of the movement.","Take a comfortable stance, and you will usually end up with something that will work.","Your squat stance actually works well for the press.","Look straight ahead to a point on the wall that is level with your eyes.","lift your chest. This is actually accomplished by placing the upper part of the erector spinae in contraction. Think about lifting your sternum up to your chin or showing off your boobs.","Take a big breath, hold it (our friend the Valsalva maneuver), and drive the bar up over your head.","have the bar directly above the back of your neck,","Once the bar is over your head correctly, lock your elbows and shrug up your shoulders to support the bar.","It is helpful to think about the lockout as a continuation of the upward drive, as though you are never finished pressing the bar upward.","Instead of moving the bar horizontally during the press, this distance is covered by the movement of the body.","squeeze your quads tight to lock the knees hard in extension, and then squeeze your abs tight to set your lumbar spine from the front.","push your hips forward so that your weight goes onto your toes. This movement must not be produced by bending the knees or lumbar spine.","push into it fast and feel the rebound as you reach the tension. Your weight should shift to the toes and then back to the mid-foot as you re-center after the rebound.","that will cause the shoulders to move down and up a little during the motion.","Make a springy platform for the bounce by tightening your “armpit”","catch the upward bounce and drive the bar to lockout.","As soon as the bar crosses the top of your forehead, get under the bar. Move your body forward under the bar and drive it to lockout. Don’t move the bar back","To further reinforce the vertical bar path, think about keeping the bar close to your face on the way up.","until the bar speed begins to slow markedly on the fifth rep of the set, and call it a workout."]},{"title":"Faults and Corrections","highlights":["You will have to take a new breath before each rep or you risk a “blackout” at heavier weights.","raise your elbows until they are just in front of the bar,","Getting under the bar comes from a shift in torso position, not from a shift in the center of mass of the whole system.","the press itself provides enough ab work for most people.","requires enough forward motion that the weight of the system shifts to your toes at the apex of the push forward, and slams back in place over mid-foot as the press begins."]}]},{"title":"The Deadlift","subchapters":[{"title":"Intro","highlights":["So if all the warm-ups possible are done with a double-overhand grip, and the alternate grip is reserved for the really heavy sets, grip strength develops quickly.","(Most lifters prefer the non-dexterous hand for the supine, or underhand, side of the alternate grip.)","The back will not pull off the floor what the hands cannot hold, due to proprioceptive feedback that tells the back that the weight is too heavy.","Gripping the bar correctly, well down into the hook of the fingers, will reduce the amount of callus development.","The bar should be between the distal transverse crease and the proximal digital crease."]},{"title":"Learning to Deadlift","highlights":["There is never a reason for anyone other than a competitive lifter to start heavier than 135 pounds.","The stance for the deadlift is about the same as the stance for a flat-footed vertical jump,","with the toes pointed out.","This stance is much narrower than the squat’s stance","The bar should be 1 inch from your shins.","the bar directly over the middle of the foot, the position over which the bar stays on its way up to lockout.","middle of the whole foot,","point your toes out. The angle will be at least 10 degrees and maybe as much as 30 degrees","places your hands in a position close to your legs, without being so close that you rub your thumbs against them as you pull.","Most people’s hands will be about an inch into the knurl,","bending over at the waist, stiff-legged, without lowering the hips.","bend your knees and drop them forward just to the point where the shins touch the bar.","Hips do not drop down during this movement – only the knees and shins move.","Now shove your knees out just a little to establish the slight angle of the thighs and knees that keeps them parallel to your feet. Knees will be in contact with elbows after this happens,","squeeze your chest up","lumbar spine is tightened into contraction as well.","stare at a point 12– 15 feet in front of you on the floor so that your neck can assume its normal anatomical position.","Keep your hips up, and compensate for this weird feeling by squeezing the chest up even more.","Take a big breath and drag the bar up your legs.","the bar never leaves contact with your legs on the way up to lockout.","before you start the pull, get your weight back off of your toes.","think about pushing the mid-foot straight down into the floor. At the top of the pull, just lift your chest. That’s all;","first unlocking your hips and knees, and then shoving your hips backward and letting the bar slide down your thighs in a straight vertical line, with your lower back locked in extension,","As the bar passes your knees, bend them"]},{"title":"Back Position","highlights":["arch your lower back by thinking about sticking your butt out.","Muscular men will be in the correct position when the low back appears flat","Take your correct starting stance, set your back, and lower yourself into position a little at a time"]},{"title":"Pulling Mechanics","highlights":["your shoulders will be slightly in front of the bar, and your arms will not be perpendicular to the floor.","starting the plates right off the floor with the same back angle used until the bar approaches the knees.","knees first, then hips – allows for a vertical bar path.","squeezing your hamstrings and glutes tight before you pull,","The correct starting position (A),","Make sure the bar is touching your skin or your socks before it leaves the floor. It is not necessary to bump your shins with the bar or to scrape the skin off on the way up.","the best grip for the deadlift is one that allows your arms to hang as straight down from the shoulders as possible when viewed from the front,"]},{"title":"The Little Details","highlights":["inhale while the bar is on the floor, before you start the pull, not while you’re supporting a heavy weight at the top. And exhale after you’re finished with the rep, which happens when the bar is back on the floor.","easy and strong are usually opposing concepts.","squeezing your low back and abs and chest all at the same time on a big breath, not as separate muscle groups but taken as a whole unit.","Your arms must stay straight during the deadlift.","You lock out the bar by lifting your chest and bringing your knees, hips, and lumbar spine into extension simultaneously.","holding the bar locked out at the top for just a second before you set it down,","Setting the bar down slowly uses up too much gas that could be better used in picking up your next rep.","But if you are not powerlifting, you don’t have to do limit singles. From a training standpoint, there is little to be gained by doing 1-rep max deadlifts,"]}]},{"title":"The Bench Press","subchapters":[{"title":"Intro","highlights":["“Power” bars are best for our purposes here because they are marked in ways that are the most useful for the exercises that constitute the bulk of this program."]},{"title":"Learning to Bench Press","highlights":["Eye position for the setup. The eyes look just past the bar, placing the body the correct distance down the bench.","Your feet should be flat on the ground in a comfortable spacing comparable to the squat stance, with your shins approximately vertical.","grip width will produce a vertical forearm for most people when the bar is on the chest,","The bar should rest on the heel of your palm (not up near the fingers), and directly over the bones of the forearm,","Wrap your fingers around the bar AFTER you have set it correctly on the heels of your hands.","push up on the bar, locking out your elbows. With elbows locked, move the bar out to a position directly over the line of your shoulder joints","Move the bar to this position quickly and without hesitation, with your elbows locked out the entire time.","Don’t look at the bar; look at the ceiling and just see the bar.","You will lower the bar to your chest, touch the chest, and then drive the bar right back to exactly the same position.","the middle of the sternum, a few inches below the clavicles, is a good place to start.","lower the bar to the chest, touch it without stopping,"]},{"title":"Common Problems Everyone Should Know How to Solve","highlights":["Except for the squat, there is no thumbless grip in barbell training.","rotating the hands into pronation (B), and then setting the grip (C).","the humerus, from 90 degrees of abduction to about 75 degrees.","by squeezing the chest up and rotating the shoulder joints back up under the bar.","keep your chest up high when you bench.","Bar speed is too slow when the descent produces fatigue,","Bar speed is too fast when it actually adds momentum to the load on the bar on the way down, so that you must decelerate against both the weight on the bar and the effect of its excessive velocity","Think about touching just your shirt, not your chest, with the bar.","Focus on up only.","Retract the shoulder blades by thinking about pinching a hand between them.","minimal shoulder movement should occur.","Do not push your head into the bench,","think about touching the bench with your hair instead of with your head.","fatigued neck rotate under a load, and this is just plain old dumb.","imagine someone shoving a hand under your low back as you keep your butt in contact with the bench. Then imagine a clenched fist doing the same thing.","shins are nearly vertical,"]},{"title":"Breathing","highlights":["Novices should take a breath before each rep, hold it during the rep, and exhale at lockout, using the very brief break between reps to make sure everything is positioned correctly.","If you can breathe during a rep, you’re not tight enough.","Breathing during the set consists only of topping off the huge breath taken before the first rep, after a quick exhalation that might consist of only 10% of tidal volume."]},{"title":"Racking Errors","highlights":["when the bar is moving into or out of the rack, your elbows must be locked.","Start and finish every rep from the start position over your shoulder joints.","You can set the pins at a level just barely below your chest so that if you miss a rep, you can lower the bar to the pins and escape safely."]}]},{"title":"The Power Clean","subchapters":[{"title":"Power, Force Production, and Velocity","highlights":["This range (50– 75% of 1RM) is also where the power clean usually falls as a percentage of the deadlift."]},{"title":"Learning the Power Clean","highlights":["the lower part of the pull, from the floor to the mid-thigh, gets the bar in the correct position for the explosive movement that racks the bar,","Foot position will be the same as for the deadlift,","toes pointed slightly out.","the power clean is really a jump. You will have to reset your stance before each rep, because after the jump,","The correct grip for most people will be about one handwidth wider on each side than the grip they use for the deadlift.","Your eyes will be looking at a spot on the floor about 12– 15 feet in front of you, just as in the deadlift.","Figure 6-8. The hang position.","In the hang position, your reminder for straight elbows","The next step is to get the bar onto the shoulders.","It should sit right on top of the frontal deltoids (the","meaty part of the front of the shoulders), well away from the sternum and collarbones. This position is referred to as the rack position","the elbows: they must be up very high, pointed straight forward, with the humerus as nearly parallel to the floor as possible.","Figure 6-10. The rack position, with chest up","The bar should not be sitting in the hands, and the hands are not supporting any of","the weight.","your hands are trapping it in position between your arms and shoulders, just like they do in the squat.","Lower the bar by dropping it down the chest and catching it at the hang position.","you actually drop the bar and catch it.","the arms do not flex at the elbow to raise the weight during a clean – what makes the bar go up is the jump, not your arms","the arms do not either raise OR lower the bar,","then unlock your knees and your hips. Do this by sticking your butt back as you bend your knees. Let the bar slide down your thighs to a position somewhere in the middle of your thighs. This position we will call the jumping position","Your elbows will be straight","in contact with the skin, actually touching the thighs","Figure 6-13. The jumping position.","You find this place by positioning your hips and legs to jump.","if you don’t feel the bar touch your thighs every time you clean, it is wrong.","jump straight up in the air with the bar hanging from your arms. Don’t bend your elbows.","Jump as high as you can, enough that you have to fully extend your knees and hips to do it.","jump and catch the bar on your shoulders in the rack position.","hands. Slam your elbows forward and up into the rack position from the top of the jump – go from elbows-straight directly to slammed-forward. Aim your shoulders at the bar and jam them into it","as if there is no step between straight elbows and the rack position.","the bar as it passes your chest: it should be close enough that it touches your shirt.","lower the bar to a point just below the bottom of the kneecaps. Unlock your knees, shove your hips back, and slide the bar down to a point just below the bottom of the patellas,","driving your shoulders forward,","The bar never loses contact with the thighs on the way down,","shoulders out in front of the bar, again with straight elbows.","low back should stay locked in position.","slowly slide the bar back up to the jumping position, jump, and catch the bar in the rack position.","the slow slide turns into a jump without any pause;","The elbows must remain straight during this","up through the top of the jump; they do not bend until after the jump, on your way back down.","As the bar passes your knees, let them bend a little to drop you into what is actually the starting position of the deadlift.","Don’t try to pull the bar from the bottom up the legs any faster than a slow deadlift right now","slowly slide the bar down and touch the floor with the plates and immediately start slowly back up the shins to the jumping position without losing tightness at the floor.","do only one rep at each position.","the hips lower the bar to the knees, and the knees lower the bar to the floor. Coming back up is the exact opposite movement – straighten your knees until the bar clears them,","The hook grip consists simply of laying the middle finger on top of the thumbnail as you wrap your hands around the bar, and letting the bar settle into the bottom of the “hook” made by the fingers. This grip allows the bar to rest in the bend in the fingers during the pull, not up high in the tight fist.","Figure 6-17. The hook grip.","The objective is to be pulling it as fast as possible as it touches the thighs."]},{"title":"Correcting Problems","highlights":["Keep the bar close and don’t drop your hips.","use of a video camera (if one is available), so you can see the relevant angles,","All cleans and snatches involve the shrugging of the shoulders,","the elbows NEVER rise above the level of the shoulders","Some downward bar movement is inevitable, but it must be minimized","It is okay to release the hook, or even to let the last two fingers drop off the bar if it facilitates a good rack position. It is not okay to completely let go of the bar,","the forearm is really beside the humerus, as opposed to stacked on top of it","They can hang on, or they can release to the extent that only the index, middle, and ring fingers are in contact with the bar."]},{"title":"The Power Snatch","highlights":["Don’t try to slow it down with your rowing muscles, but rather just cushion the fall with bent knees and hips.","A good jump will leave the toes pointed at the floor,","Keep the bar close to your chest on the way up, and let the elbows bend after the jump to facilitate this."]}]},{"title":"Useful Assistance Exercises","subchapters":[{"title":"Ancillary Exercises","highlights":["A shoulder-width grip is good","elbows straight","The Gold Standard rep is done from a dead hang, with a slight pause at the fully stretched-out bottom.","shoulders below the elbows.","forearms stay vertical during the whole movement.","leaning forward a little;","raising your chest into position","Exhale at the top after finishing the rep,","lock out the elbows at the top between reps."]}]},{"title":"Programming","subchapters":[{"title":"Intro","highlights":["So, as a general rule, you need to try to add weight to the work sets of the exercise every time you train, until you can’t do this anymore.","30cm wide"]},{"title":"Learning the Lifts","highlights":["Learn the squat first","the next exercise will be the press.","The deadlift will be the last thing to learn the first day.","Start the second workout with the squat, and then learn the bench press.","The power clean, being the most technically challenging of the exercises, should be introduced last,","A B Squat Squat Press Bench Press Deadlift Deadlift","The two workouts alternate across the MWF schedule for the first couple of weeks,","A B Squat Squat Press Bench Press Deadlift Power Clean","After two or three more weeks, chin-ups can be added","empty-bar sets of the barbell exercise itself, also serve to warm,","Light warm-up sets, done first with the empty bar and then progressively heavier until the work sets are loaded,","prepared with a couple of empty-bar sets, and then as many as five sets between those and the work sets.","The next upper-body","warmed up adequately with only three or four sets.","The last warm-up set should never be so heavy that it interferes with the work sets, but it must be heavy enough to allow you to feel some actual weight before you do the work sets. It might consist of only one or two reps","the warm-ups must be chosen to save gas for the heavier sets, while still being heavy enough that the first work set is not a shock.","determine the work set or sets, and then divide the difference between 45 pounds and the work-set weight into even increments.","time between sets should be sufficient for you to recover from the previous set,","The first two or three sets can be done as fast as the bar can be loaded,","perhaps 5 minutes, between the last warm-ups and the work sets.","The deadlift is hard enough, and is usually done after a lot of squatting, and one heavy set is usually sufficient,","Five reps is a good number for strength training purposes,","For most male trainees with good technique, the squat can be increased 10 pounds per workout,","most men can do 5-pound jumps","same jumps used for the bench can usually be used for the press,","Most men can add 15 pounds to the deadlift each workout","But 5-pound jumps in the deadlift should be sustainable for several months.","The power clean will move up maybe 5 pounds per workout for most men."]},{"title":"Equipment","highlights":["The surface of the bench will be 17 inches high with the padding compressed, 12 inches wide, and 48 inches long."]}]}]}